---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingHostByElementsInAnotherDesignOption
source: html/73548086-e76d-842d-9857-76884f448293.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingHostByElementsInAnotherDesignOption Property

An insert in a Design Option cannot be hosted by an element in another Design Option [--if you continue it will not be added to the design option set].

## Syntax (C#)
```csharp
public static FailureDefinitionId ConfusingHostByElementsInAnotherDesignOption { get; }
```